from typing import Dict

LEXICON: Dict[str, str] = {
    '/start': 'Здравствуйте\! 👋\nЭтот бот предназначен для отслеживания новых объявлений на Авито\. Выберите, что Вы хотите сделать, нажав на соответствующую кнопку в нижней части экрана\.',
    'list_entry': 'Список отслеживаемых ссылок:\n\n',
    'paste_new_link': 'Пожалуйста, отправьте полную ссылку на поисковую выдачу, которую хотите отслеживать\. Она должна начинаться на "https…"',
    'paste_new_heading': 'Пожалуйста, напишите, как бы Вы хотели назвать ссылку?',
    'error_paste_new_link': 'Ссылка не корректна\. Пожалуйста, проверьте ещё раз: ссылка должна быть полной и начинаться на "https…"'
}
